# isalnum()
# Метод isalnum() определяет, состоит ли исходная строка из буквенно-цифровых символов.
# Метод возвращает значение True если исходная строка является непустой и состоит только из буквенно-цифровых символов и False в противном случае.

# isalpha()
#Метод isalpha() определяет, состоит ли исходная строка из буквенных символов.
#Метод возвращает значение True если исходная строка является непустой и состоит только из буквенных символов и False в противном случае.

# isdigit()
# Метод isdigit() определяет, состоит ли исходная строка только из цифровых символов.
# Метод возвращает значение True если исходная строка является непустой и состоит только из цифровых символов и False в противном случае

# islower()
#Метод islower() определяет, являются ли все буквенные символы исходной строки строчными (имеют нижний регистр).
# Метод возвращает значение True если все буквенные символы исходной строки являются строчными и False в противном случае.
# Все неалфавитные символы игнорируются!

# isupper()
# Метод isupper() определяет, являются ли все буквенные символы исходной строки заглавными (имеют верхний регистр).
# Метод возвращает значение True если все буквенные символы исходной строки являются заглавными и False в противном случае. Все неалфавитные символы игнорируются!

# isspace()
# Метод isspace() определяет, состоит ли исходная строка только из пробельных символов.
# Метод возвращает значение True если строка состоит только из пробельных символов и False в противном случае.